tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "yt-dlp/taps"
# Graphical system information display for macOS
brew "archey"
# Core application library for C
brew "glib"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Distributed revision control system
brew "git"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Improved top (interactive process viewer)
brew "htop"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node", link: false
# Highly capable, feature-rich programming language
brew "perl"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Emulator for x86 and PowerPC
brew "qemu"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# UNIX shell (command interpreter)
brew "zsh"
# A youtube-dl fork with additional features and fixes
brew "yt-dlp/taps/yt-dlp"
# Command-line display management utility
cask "cscreen"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# extra stuff i added manually
cask "tiles"
cask "firefox"
cask "discord"
cask "telegram"
cask "spotify"
cask "foobar2000"