tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "teamookla/speedtest"
tap "yt-dlp/taps"
brew "python@3.12"
brew "python-tk@3.12"
brew "archey4"
brew "defaultbrowser"
brew "duti"
brew "ffmpeg"
brew "figlet"
brew "fluid-synth"
brew "gcc"
brew "git"
brew "htop"
brew "node", link: false
brew "qemu"
brew "rust"
brew "zsh"
brew "teamookla/speedtest/speedtest"
brew "yt-dlp/taps/yt-dlp"
cask "ableton-live-suite"
cask "audacity"
cask "blackhole-2ch"
cask "blender"
cask "cscreen"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-league-mono"
cask "foobar2000"
cask "fspy"
cask "godot"
cask "handbrake"
cask "ilok-license-manager"
cask "kitty"
cask "native-access"
cask "obs"
cask "obsidian"
cask "qbittorrent"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "tiles"
cask "vlc"
cask "visual-studio-code"
cask "affinity-photo"
cask "platypus"