tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "yt-dlp/taps"
cask "font-jetbrains-mono-nerd-font"
brew "archey"
brew "ffmpeg"
brew "figlet"
brew "fluid-synth"
brew "git"
brew "htop"
brew "node", link: false
brew "python@3.11"
brew "rust"
brew "gcc"
brew "qemu"
brew "zsh"
brew "duti"
brew "defaultbrowser"
brew "yt-dlp/taps/yt-dlp"
cask "cscreen"
cask "vscodium"
cask "tiles"
cask "firefox"
cask "discord"
cask "telegram"
cask "spotify"
cask "foobar2000"
cask "blender"
cask "handbrake"
cask "obs"
cask "the-unarchiver"
cask "vlc"
cask "kitty"
cask "obsidian"
cask "ableton-live-suite"
cask "blackhole-2ch"